In [3]:
import pandas as pd

people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [4]:
df = pd.DataFrame(people)

In [5]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']

In [8]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [11]:
df.drop(columns=['first','last'])
# hogy fog kinezni

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [14]:
df.drop(columns=['first','last'], inplace=True)
df

KeyError: "['first' 'last'] not found in axis"

In [15]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [18]:
df['full_name'].str.split(' ' ,expand =True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [19]:
df[['first','last']] = df['full_name'].str.split(' ' ,expand =True)

In [21]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [22]:
df.append({'first' : 'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [23]:
people = {
    "first": ["Tony", 'Morty'], 
    "last": ["Sanches", 'Defo'], 
    "email": ["Morty@series.com", 'france@email.com']
}

In [25]:
df2 = pd.DataFrame(people)

In [28]:
df2

   first     last             email
0   Tony  Sanches  Morty@series.com
1  Morty     Defo  france@email.com

In [30]:
df.append(df2,ignore_index=True)

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@email.com   Jane       Jane Doe      Doe
2        JohnDoe@email.com   John       John Doe      Doe
3         Morty@series.com   Tony            NaN  Sanches
4         france@email.com  Morty            NaN     Defo

In [32]:
df = df.append(df2,ignore_index=True)

In [34]:
df.drop(index=4)

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@email.com   Jane       Jane Doe      Doe
2        JohnDoe@email.com   John       John Doe      Doe
3         Morty@series.com   Tony            NaN  Sanches
5         Morty@series.com   Tony            NaN  Sanches
6         france@email.com  Morty            NaN     Defo

In [36]:
# felteteles index alapjan drop
df.drop(index= df[ df['last']== 'Sanches'].index )

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@email.com   Jane       Jane Doe      Doe
2        JohnDoe@email.com   John       John Doe      Doe
4         france@email.com  Morty            NaN     Defo
6         france@email.com  Morty            NaN     Defo

In [37]:
# filter kirakrjuk a jobb olvashatosag miatt
filt_Defo = df[ df['last']== 'Defo']
df.drop(index = filt_Defo.index)

                     email  first      full_name     last
0  CoreyMSchafer@gmail.com  Corey  Corey Schafer  Schafer
1        JaneDoe@email.com   Jane       Jane Doe      Doe
2        JohnDoe@email.com   John       John Doe      Doe
3         Morty@series.com   Tony            NaN  Sanches
5         Morty@series.com   Tony            NaN  Sanches